ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/serial_api.c
    return 0;
}


/** Calculates fractional divider value.
 *
 * @param frequency The desired frequency of UART clock
 * @param frac_bits The number of fractional bits in the divider
 * @return The divider value
 */
static uint32_t divider_value(uint32_t frequency, uint32_t frac_bits)
{
    /* UARTs use peripheral clock */
    return ((cy_PeriClkFreqHz * (1 << frac_bits)) + (frequency / 2)) / frequency;
}


#define FRACT_DIV_INT(divider)      (((divider) >> 5U) - 1U)
#define FRACT_DIV_FARCT(divider)    ((divider) & 0x1FU)

/** Finds clock divider, configures it and connects to SCB block.
 *
 * @param obj      The serial object
 * @param baudrate The desired UART baud rate
 * @return CY_SYSCLK_SUCCESS if operation successful and CY_SYSCLK_BAD_PARAM otherwise
 */
static cy_en_sysclk_status_t serial_init_clock(serial_obj_t *obj, uint32_t baudrate)
{
    cy_en_sysclk_status_t status = CY_SYSCLK_BAD_PARAM;

    if (obj->div_num == CY_INVALID_DIVIDER) {
        uint32_t divider_num = cy_clk_allocate_divider(CY_SYSCLK_DIV_16_5_BIT);

        if (divider_num < PERI_DIV_16_5_NR) {
            /* Assign fractional divider */
            status = Cy_SysClk_PeriphAssignDivider(obj->clock, CY_SYSCLK_DIV_16_5_BIT, divider_num);
            if (status == CY_SYSCLK_SUCCESS) {
                obj->div_type = CY_SYSCLK_DIV_16_5_BIT;
                obj->div_num  = divider_num;
            }
        } else {
            // Try 16-bit divider.
            divider_num = cy_clk_allocate_divider(CY_SYSCLK_DIV_16_BIT);
            if (divider_num < PERI_DIV_16_NR) {
                /* Assign 16-bit divider */
                status = Cy_SysClk_PeriphAssignDivider(obj->clock, CY_SYSCLK_DIV_16_BIT, divider_num);
                if (status == CY_SYSCLK_SUCCESS) {
                    obj->div_type = CY_SYSCLK_DIV_16_BIT;
                    obj->div_num  = divider_num;
                }
            } else {
                error("Serial: cannot assign clock divider.");
            }
        }
    } else {
        /* Divider already allocated and connected to the SCB block */
        status = CY_SYSCLK_SUCCESS;
    }

    if (status == CY_SYSCLK_SUCCESS) {
        Cy_SysClk_PeriphDisableDivider(obj->div_type, obj->div_num);

        /* Set baud rate */
        if ((obj->div_type == CY_SYSCLK_DIV_16_5_BIT) || (obj->div_type == CY_SYSCLK_DIV_24_5_BIT)) {
            /* Get fractional divider */
            uint32_t divider = divider_value(baudrate * UART_OVERSAMPLE, 5U);

            status = Cy_SysClk_PeriphSetFracDivider(obj->div_type,
                                                    obj->div_num,
                                                    FRACT_DIV_INT(divider),
                                                    FRACT_DIV_FARCT(divider));
        } else {
            /* Get integer divider */
            status = Cy_SysClk_PeriphSetDivider(obj->div_type,
                                                obj->div_num,
                                                divider_value(baudrate * UART_OVERSAMPLE, 0));
        }

        Cy_SysClk_PeriphEnableDivider(obj->div_type, obj->div_num);
    }

    return status;
}


/** Initializes i/o pins for UART tx/rx.
 *
 * @param obj The serial object
 */
static void serial_init_pins(serial_obj_t *obj)
{
    if ((cy_reserve_io_pin(obj->pin_tx) || cy_reserve_io_pin(obj->pin_rx))
            && !obj->already_reserved) {
        error("Serial TX/RX pin reservation conflict.");
    }

    pin_function(obj->pin_tx, pinmap_function(obj->pin_tx, PinMap_UART_TX));
    pin_function(obj->pin_rx, pinmap_function(obj->pin_rx, PinMap_UART_RX));
}


/** Initializes i/o pins for UART flow control
 *
 * @param obj The serial object
 */
static void serial_init_flow_pins(serial_obj_t *obj)
{
    if (obj->pin_rts != NC) {
        if ((0 != cy_reserve_io_pin(obj->pin_rts)) && !obj->already_reserved) {
            error("Serial RTS pin reservation conflict.");
        }
        pin_function(obj->pin_rts, pinmap_function(obj->pin_rts, PinMap_UART_RTS));
    }

    if (obj->pin_cts != NC) {
        if ((0 != cy_reserve_io_pin(obj->pin_cts)) && !obj->already_reserved) {
            error("Serial CTS pin reservation conflict.");
        }
        pin_function(obj->pin_cts, pinmap_function(obj->pin_cts, PinMap_UART_CTS));
    }
}


/** Initializes and enables UART/SCB.
 *
 * @param obj The serial object
 */
static void serial_init_peripheral(serial_obj_t *obj)
{
    cy_stc_scb_uart_config_t uart_config = default_uart_config;

    uart_config.dataWidth = obj->data_width;
    uart_config.parity    = obj->parity;
    uart_config.stopBits  = obj->stop_bits;
    uart_config.enableCts = (obj->pin_cts != NC);

    Cy_SCB_UART_Init(obj->base, &uart_config, NULL);
    Cy_SCB_UART_Enable(obj->base);
}

/*
 * Callback function to handle into and out of deep sleep state transitions.
 */
#if DEVICE_SLEEP && DEVICE_LPTICKER && SERIAL_PM_CALLBACK_ENABLED
static cy_en_syspm_status_t serial_pm_callback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    serial_obj_t *obj = (serial_obj_t *) callbackParams->context;
    cy_en_syspm_status_t status = CY_SYSPM_FAIL;
    GPIO_PRT_Type *port_tx = Cy_GPIO_PortToAddr(CY_PORT(obj->pin_tx));
    GPIO_PRT_Type *port_rts = Cy_GPIO_PortToAddr(CY_PORT(obj->pin_rts));

    switch (mode) {
        case CY_SYSPM_CHECK_READY:
            /* If all data elements are transmitted from the TX FIFO and
            * shifter and the RX FIFO is empty: the UART is ready to enter
            * Deep Sleep mode.
            */
            if (Cy_SCB_UART_IsTxComplete(obj->base)) {
                if (0 == Cy_SCB_UART_GetNumInRxFifo(obj->base)) {
                    /* Configure RTS and TX GPIO DR register to drive output (high) */
                    if(obj->pin_rts != NC) {
                        uint32_t rts_polarity = Cy_SCB_UART_GetRtsAcitvePolarity(obj->base);
                        uint32_t rts_value = ((rts_polarity == CY_SCB_UART_ACTIVE_LOW) ? CY_SCB_UART_ACTIVE_HIGH : CY_SCB_UART_ACTIVE_LOW);
                        Cy_GPIO_Write   (port_rts, CY_PIN(obj->pin_rts), rts_value);
                        Cy_GPIO_SetHSIOM(port_rts, CY_PIN(obj->pin_rts), HSIOM_SEL_GPIO);
                    }

                    Cy_GPIO_Write   (port_tx, CY_PIN(obj->pin_tx), 1);
                    Cy_GPIO_SetHSIOM(port_tx, CY_PIN(obj->pin_tx), HSIOM_SEL_GPIO);

                    /* Disable the UART. The transmitter stops driving the
                    * lines and the receiver stops receiving data until
                    * the UART is enabled.
                    * This happens when the device failed to enter Deep
                    * Sleep or it is awaken from Deep Sleep mode.
                    */
                    Cy_SCB_UART_Disable(obj->base, NULL);
                    status = CY_SYSPM_SUCCESS;
                }
            }
            break;

        case CY_SYSPM_CHECK_FAIL:
            /* Enable the UART to operate */
            Cy_SCB_UART_Enable(obj->base);
            /* Return SCB control on TX and RTS output pins */
            if(obj->pin_rts != NC) {
                Cy_GPIO_SetHSIOM(port_rts, CY_PIN(obj->pin_rts), CY_PIN_HSIOM(pinmap_function(obj->pin_rts, PinMap_UART_RTS)));
            }

