ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/serial_api.c
    /* Enable interrupts to start receiving */
    Cy_SCB_SetRxInterruptMask(obj->base, UART_RX_INTR_MASK);
}


uint8_t serial_tx_active(serial_t *obj)
{
    return obj->serial.tx_pending;
}


uint8_t serial_rx_active(serial_t *obj)
{
    return obj->serial.rx_pending;
}


/** Finishes TX asynchronous transfer: disable TX interrupts and clear
 * pending state.
 *
 * @param obj The serial object
 */
static void serial_finish_tx_asynch(serial_obj_t *obj)
{
    Cy_SCB_SetTxInterruptMask(obj->base, 0);
    obj->tx_pending = false;
}


/** Finishes TX asynchronous transfer: disable TX interrupts and clear
 * pending state.
 *
 * @param obj The serial object
 */
static void serial_finish_rx_asynch(serial_obj_t *obj)
{
    Cy_SCB_SetRxInterruptMask(obj->base, 0);
    obj->rx_pending = false;
}


int serial_irq_handler_asynch(serial_t *obj_in)
{
    uint32_t cur_events = 0;
    uint32_t tx_status;
    uint32_t rx_status;

    serial_obj_t *obj = OBJ_P(obj_in);

    /* Interrupt cause is TX */
    if (0 != (CY_SCB_TX_INTR & Cy_SCB_GetInterruptCause(obj->base))) {

        /* Get interrupt sources and clear them */
        tx_status = Cy_SCB_GetTxInterruptStatusMasked(obj->base);
        Cy_SCB_ClearTxInterrupt(obj->base, tx_status);

        if (0 != (tx_status & CY_SCB_TX_INTR_LEVEL)) {

            /* Get current buffer position */
            uint8_t *ptr = obj_in->tx_buff.buffer;
            ptr += obj_in->tx_buff.pos;

            /* FIFO has space available for more TX */
            while ((obj_in->tx_buff.pos < obj_in->tx_buff.length) &&
                    (0 != Cy_SCB_UART_Put(obj->base, *ptr))) {
                ++ptr;
                ++(obj_in->tx_buff.pos);
            }

            if (obj_in->tx_buff.pos == obj_in->tx_buff.length) {
                /* No more bytes to follow; check to see if we need to signal completion */
                if (0 != (obj->tx_events & SERIAL_EVENT_TX_COMPLETE)) {
                    /* Disable TX_LEVEL and enable TX_DONE to get completion event */
                    Cy_SCB_SetTxInterruptMask(obj->base, CY_SCB_UART_TX_DONE);
                } else {
                    /* Nothing more to do, mark end of transmission */
                    serial_finish_tx_asynch(obj);
                }
            }
        }

        if (0 != (tx_status & CY_SCB_TX_INTR_UART_DONE)) {
            /* Mark end of the transmission */
            serial_finish_tx_asynch(obj);
            cur_events |= SERIAL_EVENT_TX_COMPLETE;
        }
    }

    /* Interrupt cause is RX */
    if (0 != (CY_SCB_RX_INTR & Cy_SCB_GetInterruptCause(obj->base))) {

        /* Get interrupt sources and clear them */
        rx_status = Cy_SCB_GetRxInterruptStatusMasked(obj->base);
        Cy_SCB_ClearRxInterrupt(obj->base, rx_status);

        if (0 != (rx_status & CY_SCB_RX_INTR_OVERFLOW)) {
            cur_events |= SERIAL_EVENT_RX_OVERRUN_ERROR;
        }

        if (0 != (rx_status & CY_SCB_RX_INTR_UART_FRAME_ERROR)) {
            cur_events |= SERIAL_EVENT_RX_FRAMING_ERROR;
        }

        if (0 != (rx_status & CY_SCB_RX_INTR_UART_PARITY_ERROR)) {
            cur_events |= SERIAL_EVENT_RX_PARITY_ERROR;
        }

        if (0 != (rx_status & CY_SCB_RX_INTR_LEVEL)) {

            /* Get current buffer position */
            uint8_t *ptr = obj_in->rx_buff.buffer;
            ptr += obj_in->rx_buff.pos;

            /* Get data from the RX FIFO */
            while (obj_in->rx_buff.pos < obj_in->rx_buff.length) {
                uint32_t c = Cy_SCB_UART_Get(obj->base);

                if (c == CY_SCB_UART_RX_NO_DATA) {
                    break;
                }

                *ptr++ = (uint8_t) c;
                ++(obj_in->rx_buff.pos);

                /* Check for character match condition */
                if (obj_in->char_match != SERIAL_RESERVED_CHAR_MATCH) {
                    if (c == obj_in->char_match)  {
                        obj_in->char_found = true;
                        cur_events |= SERIAL_EVENT_RX_CHARACTER_MATCH;

                        /* Clamp RX buffer */
                        obj_in->rx_buff.length = obj_in->rx_buff.pos;
                        break;
                    }
                }
            }
        }

        if (obj_in->rx_buff.pos == obj_in->rx_buff.length) {
            serial_finish_rx_asynch(obj);
            cur_events |= SERIAL_EVENT_RX_COMPLETE;
        }
    }

    return (cur_events & (obj->tx_events | obj->rx_events));
}


void serial_tx_abort_asynch(serial_t *obj_in)
{
    serial_obj_t *obj = OBJ_P(obj_in);

    serial_finish_tx_asynch(obj);
    Cy_SCB_UART_ClearTxFifo(obj->base);
}

void serial_rx_abort_asynch(serial_t *obj_in)
{
    serial_obj_t *obj = OBJ_P(obj_in);

    serial_finish_rx_asynch(obj);
    Cy_SCB_UART_ClearRxFifo(obj->base);
    Cy_SCB_ClearRxInterrupt(obj->base, CY_SCB_UART_RX_INTR_MASK);
}

#endif /* DEVICE_SERIAL_ASYNCH */

#endif /* DEVICE_SERIAL */
